
import Foundation
import UIKit


struct DiseaseInfo {
    let arabicName: String
    let treatment: String
    let tips: String
    let imageData : Data?
    
    
    static let data: [String: (name: String, tips: String , treatment: String)] = [
           "0 Apple___Apple_scab":
            ("جرب التفاح", "يجب إزالة الأوراق والفروع المصابة واحتراقها، واستخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "1 Apple___Black_rot": ("تعفن أسود", "يجب إزالة الفواكه والأوراق المصابة واحتراقها، واستخدام المبيدات الفطرية المناسبة." , "score 250 EC"),
           "2 Apple___Cedar_apple_rust": ("صدأ تفاح الأرز", "يجب إزالة الأغصان المصابة واستخدام مبيدات الفطريات." , "score 250 EC"),
           "3 Apple___healthy": ("صحي", "لا يحتاج إلى علاج." , "لا تحتاج الى مبيدات"),
           "4 Bean___angular_leaf_spot": ("بقعة الورقة الزاوية", "استخدام مبيدات الفطريات المناسبة والحفاظ على نظافة المزرعة.", "score 250 EC"),
           "5 Bean___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "6 Bean___rust": ("صدأ الفول", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "7 Corn___Cercospora_leaf_spot Gray_leaf_spot": ("بقعة ورقة سيركوسبورا", "استخدام مبيدات الفطريات المناسبة والحد من الرطوبة."  , "score 250 EC"),
           "8 Corn___Common_rust": ("صدأ الذرة الشائع", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "9 Corn___Northern_Leaf_Blight": ("اللفحة الشمالية للورقة", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "10 Corn___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "11 Cucumber___Anthracnose": ("أنثراكنوز", "إزالة الأجزاء المصابة واستخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "12 Cucumber___Gummy Stem Blight": ("اللفحة الجذعية اللزجة", "استخدام مبيدات الفطريات المناسبة وتجنب الرطوبة الزائدة." , "score 250 EC"),
           "13 Cucumber___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "14 Grape___Black_rot": ("تعفن أسود العنب", "إزالة الأوراق والفواكه المصابة واستخدام مبيدات الفطريات المناسبة." , "switch"),
           "15 Grape___Esca_(Black_Measles)": ("إيسكا (حصبة سوداء)", "إزالة الأجزاء المصابة من النبات." , "score 250 EC"),
           "16 Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": ("لفحة الورقة (بقعة ورقة إيساريوبيس)", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "17 Grape___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "18 Pepper_bell___Bacterial_spot": ("بقعة بكتيرية", "استخدام المبيدات البكتيرية المناسبة." , "score 250 EC"),
           "19 Pepper_bell___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "20 Potato___Early_blight": ("اللفحة المبكرة", "إزالة الأجزاء المصابة واستخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "21 Potato___Late_blight": ("اللفحة المتأخرة", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "22 Potato___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "23 Strawberry___Leaf_scorch": ("حرق الورقة", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "24 Strawberry___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "25 Tomato___Bacterial_spot": ("بقعة بكتيرية", "استخدام المبيدات البكتيرية المناسبة." , "score 250 EC"),
           "26 Tomato___Early_blight": ("اللفحة المبكرة", "إزالة الأوراق المصابة واستخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "27 Tomato___Late_blight": ("اللفحة المتأخرة", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "28 Tomato___Leaf_Mold": ("عفن الأوراق", "إزالة الأوراق المصابة واستخدام مبيدات الفطريات." , "score 250 EC"),
           "29 Tomato___Septoria_leaf_spot": ("بقعة أوراق سيبتوريا", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "30 Tomato___Spider_mites Two-spotted_spider_mite": ("سوس العنكبوت ذو البقعتين", "استخدام المبيدات الحشرية المناسبة." , "score 250 EC"),
           "31 Tomato___Target_Spot": ("بقعة الهدف", "استخدام مبيدات الفطريات المناسبة." , "score 250 EC"),
           "32 Tomato___Tomato_mosaic_virus": ("فيروس موزاييك الطماطم", "إزالة النباتات المصابة." , "score 250 EC"),
           "33 Tomato___healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "34 olive_aculus_olearius": ("أكلوس أوليريوس الزيتون", "استخدام المبيدات الحشرية المناسبة." , "score 250 EC"),
           "35 olive_healthy": ("صحي", "لا يحتاج إلى علاج." , ""),
           "36 olive_peacock_spot": ("بقعة الطاووس الزيتون", "استخدام مبيدات الفطريات المناسبة." , "funguran")
       ]
}
